# Задание 3: Создайте две переменные с числами и поменяйте их значения местами
# a = 10
# b = 20
# ваш код здесь

print()
a = 10
b = 20
print("a = ", a, ", ", "b = ", b)

# Меняем значения переменных местами.
a, b = b, a
print("Меняем значения переменных местами.")
print("a = ", a, ", ",  "b = ", b)