# Задание 2: Выведите информацию о себе в формате:
# "Меня зовут [имя], мне [возраст] лет, я из [город]"
# Используйте f-строки

name = "Григорий"
age = 50
city = "Новосибирск"
print()
print(f"Меня зовут {name}, мне {age} лет, я из города {city}.")