# Задание 1: Создайте переменные
# name = ваше_имя
# age = ваш_возраст
# city = ваш_город

name = "Григорий"
age = 50
city = "Новосибирск"
print(name, age, city)