# Задание 4: Вычислите периметр и площадь прямоугольника
# length = 15
# width = 7
# perimeter = ?
# area = ?

length = 15
width = 7
perimeter = 2 * (length + width)
area = length * width

print("Результаты подсчетов:")
print("perimeter = ", perimeter)
print("area = ", area)