# Задание 5: Создайте строку и выведите:
# - Первый символ
# - Последний символ
# - Срез с 3 по 7 символ
# text = "Программирование на Python"

text = "Программирование на Python"
print('Дана строка - "Программирование на Python"')
print(f"Первый символ -  {text[0]}.")
print(f"Последний символ -  {text[-1]}.")
print(f"Срез с 3 по 7 символ -  {text[2:7]}.")